Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/svd/WBZ351.svd
            <register>
               <name>ADCIMCON1</name>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SIGN0</name>
                     <description>AN0 Signed Data Mode bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SIGN0Select</name>
                        <enumeratedValue>
                           <name>SIGNED</name>
                           <description>AN0 is using Signed Data mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNSIGNED</name>
                           <description>AN0 is using Unsigned Data mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFF0</name>
                     <description>AN0 Mode bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIFF0Select</name>
                        <enumeratedValue>
                           <name>DIFF</name>
                           <description>Selects AN0 differential input pair as AN0+ and ANN0-</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>AN0 is using Single-ended mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIGN1</name>
                     <description>AN1 Signed Data Mode bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SIGN1Select</name>
                        <enumeratedValue>
                           <name>SIGNED</name>
                           <description>AN1 is using Signed Data mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNSIGNED</name>
                           <description>AN1 is using Unsigned Data mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFF1</name>
                     <description>AN1 Mode bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIFF1Select</name>
                        <enumeratedValue>
                           <name>DIFF</name>
                           <description>Selects AN1 differential input pair as AN1+ and ANN0-</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>AN1 is using Single-ended mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIGN2</name>
                     <description>AN2 Signed Data Mode bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SIGN2Select</name>
                        <enumeratedValue>
                           <name>SIGNED</name>
                           <description>AN2 is using Signed Data mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNSIGNED</name>
                           <description>AN2 is using Unsigned Data mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFF2</name>
                     <description>AN2 Mode bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIFF2Select</name>
                        <enumeratedValue>
                           <name>DIFF</name>
                           <description>Selects AN2 differential input pair as AN2+ and ANN0-</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>AN2 is using Single-ended mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIGN3</name>
                     <description>AN3 Signed Data Mode bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SIGN3Select</name>
                        <enumeratedValue>
                           <name>SIGNED</name>
                           <description>AN3 is using Signed Data mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNSIGNED</name>
                           <description>AN3 is using Unsigned Data mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFF3</name>
                     <description>AN3 Mode bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIFF3Select</name>
                        <enumeratedValue>
                           <name>DIFF</name>
                           <description>Selects AN3 differential input pair as AN3+ and ANN0-</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>AN3 is using Single-ended mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIGN4</name>
                     <description>AN4 Signed Data Mode bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SIGN4Select</name>
                        <enumeratedValue>
                           <name>SIGNED</name>
                           <description>AN4 is using Signed Data mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNSIGNED</name>
                           <description>AN4 is using Unsigned Data mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFF4</name>
                     <description>AN4 Mode bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIFF4Select</name>
                        <enumeratedValue>
                           <name>DIFF</name>
                           <description>Selects AN4 differential input pair as AN4+ and ANN0-</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>AN4 is using Single-ended mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIGN5</name>
                     <description>AN5 Signed Data Mode bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SIGN5Select</name>
                        <enumeratedValue>
                           <name>SIGNED</name>
                           <description>AN5 is using Signed Data mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNSIGNED</name>
                           <description>AN5 is using Unsigned Data mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFF5</name>
                     <description>AN5 Mode bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIFF5Select</name>
                        <enumeratedValue>
                           <name>DIFF</name>
                           <description>Selects AN5 differential input pair as AN5+ and ANN0-</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>AN5 is using Single-ended mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIGN6</name>
                     <description>AN6 Signed Data Mode bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SIGN6Select</name>
                        <enumeratedValue>
                           <name>SIGNED</name>
                           <description>AN6 is using Signed Data mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNSIGNED</name>
                           <description>AN6 is using Unsigned Data mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFF6</name>
                     <description>AN6 Mode bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIFF6Select</name>
                        <enumeratedValue>
                           <name>DIFF</name>
                           <description>Selects AN6 differential input pair as AN6+ and ANN0-</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>AN6 is using Single-ended mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIGN7</name>
                     <description>AN7 Signed Data Mode bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SIGN7Select</name>
                        <enumeratedValue>
                           <name>SIGNED</name>
                           <description>AN7 is using Signed Data mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNSIGNED</name>
                           <description>AN7 is using Unsigned Data mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFF7</name>
                     <description>AN7 Mode bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIFF7Select</name>
                        <enumeratedValue>
                           <name>DIFF</name>
                           <description>Selects AN7 differential input pair as AN7+ and ANN0-</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>AN7 is using Single-ended mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIGN8</name>
                     <description>AN8 Signed Data Mode bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SIGN8Select</name>
                        <enumeratedValue>
                           <name>SIGNED</name>
                           <description>AN8 is using Signed Data mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNSIGNED</name>
                           <description>AN8 is using Unsigned Data mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFF8</name>
                     <description>AN 8 Mode bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIFF8Select</name>
                        <enumeratedValue>
                           <name>DIFF</name>
                           <description>Selects AN8 differential input pair as AN8+ and ANN0-</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>AN8 is using Single-ended mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIGN9</name>
                     <description>AN9 Signed Data Mode bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SIGN9Select</name>
                        <enumeratedValue>
                           <name>SIGNED</name>
                           <description>AN9 is using Signed Data mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNSIGNED</name>
                           <description>AN9 is using Unsigned Data mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFF9</name>
                     <description>AN9 Mode bit</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIFF9Select</name>
                        <enumeratedValue>
                           <name>DIFF</name>
                           <description>Selects AN9 differential input pair as AN9+ and ANN0-</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>AN9 is using Single-ended mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIGN10</name>
                     <description>AN10 Signed Data Mode bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SIGN10Select</name>
                        <enumeratedValue>
                           <name>SIGNED</name>
                           <description>AN10 is using Signed Data mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNSIGNED</name>
                           <description>AN10 is using Unsigned Data mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFF10</name>
                     <description>AN10 Mode bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIFF10Select</name>
                        <enumeratedValue>
                           <name>DIFF</name>
                           <description>Selects AN10 differential input pair as AN10+ and ANN0-</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>AN10 is using Single-ended mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIGN11</name>
                     <description>AN11 Signed Data Mode bit</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SIGN11Select</name>
                        <enumeratedValue>
                           <name>SIGNED</name>
                           <description>AN11 is using Signed Data mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNSIGNED</name>
                           <description>AN11 is using Unsigned Data mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFF11</name>
                     <description>AN11 Mode bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DIFF11Select</name>
                        <enumeratedValue>
                           <name>DIFF</name>
                           <description>Selects AN11 differential input pair as AN11+ and ANN0-</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>AN11 is using Single-ended mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
