Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/svd/WBZ351.svd
            <register>
               <name>ADTRG2CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x214</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADTRG2SET</name>
               <description>Bit set register</description>
               <addressOffset>0x218</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADTRG2INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x21c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADTRG3CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x224</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADTRG3SET</name>
               <description>Bit set register</description>
               <addressOffset>0x228</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADTRG3INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x22c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCCMPCON1CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x284</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCCMPCON1SET</name>
               <description>Bit set register</description>
               <addressOffset>0x288</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCCMPCON1INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x28c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCMPCON2CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x294</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCMPCON2SET</name>
               <description>Bit set register</description>
               <addressOffset>0x298</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCMPCON2INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x29c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCFSTATCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x2e4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCFSTATSET</name>
               <description>Bit set register</description>
               <addressOffset>0x2e8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCFSTATINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x2ec</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCFIFOCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x2f4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCFIFOSET</name>
               <description>Bit set register</description>
               <addressOffset>0x2f8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCFIFOINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x2fc</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCBASECLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x304</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCBASESET</name>
               <description>Bit set register</description>
               <addressOffset>0x308</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCBASEINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x30c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCDMASTATCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x314</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCDMASTATSET</name>
               <description>Bit set register</description>
               <addressOffset>0x318</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCDMASTATINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x31c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCCNTBCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x324</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCCNTBSET</name>
               <description>Bit set register</description>
               <addressOffset>0x328</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCCNTBINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x32c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCDMABCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x334</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCDMABSET</name>
               <description>Bit set register</description>
               <addressOffset>0x338</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCDMABINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x33c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCTRGSNSCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x344</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCTRGSNSSET</name>
               <description>Bit set register</description>
               <addressOffset>0x348</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCTRGSNSINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x34c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADC0TIMECLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x354</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADC0TIMESET</name>
               <description>Bit set register</description>
               <addressOffset>0x358</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADC0TIMEINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x35c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCEISTAT1CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x3e4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCEISTAT1SET</name>
               <description>Bit set register</description>
               <addressOffset>0x3e8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCEISTAT1INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x3ec</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCANLCTLCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x404</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCANLCTLSET</name>
               <description>Bit set register</description>
               <addressOffset>0x408</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCANLCTLINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x40c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCFGSHRCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x674</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCFGSHRSET</name>
               <description>Bit set register</description>
               <addressOffset>0x678</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCFGSHRINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x67c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCSVCONCLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x684</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCSVCONSET</name>
               <description>Bit set register</description>
               <addressOffset>0x688</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCSVCONINV</name>
               <description>Bit invert register</description>
               <addressOffset>0x68c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCSYSCFG0CLR</name>
               <description>Bit clear register</description>
               <addressOffset>0x704</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCSYSCFG0SET</name>
               <description>Bit set register</description>
               <addressOffset>0x708</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ADCSYSCFG0INV</name>
               <description>Bit invert register</description>
               <addressOffset>0x70c</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
