Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/WBZ35/svd/WBZ351.svd
               <register>
                  <name>RNG_CONTROL_AIS31CONF2</name>
                  <description>AIS31 configuration register 2.</description>
                  <addressOffset>0x1050</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>HMIN</name>
                        <description>Minimum allowed history value.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>HMAX</name>
                        <description>Maximum allowed history value.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_AIS31STATUS</name>
                  <description>AIS31 status register.</description>
                  <addressOffset>0x1054</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>NUMPRELIMALARMS</name>
                        <description>Number of preliminary noise alarms since counter was last cleared.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>PRELIMNOISEALARMRNG</name>
                        <description>Last preliminary noise alarm occurred due to history value out of range.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PRELIMNOISEALARMREP</name>
                        <description>Last preliminary noise alarm occurred due to consecutive high X**2.</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_CONTROL_HWCONFIG</name>
                  <description>Hardware configuration register.</description>
                  <addressOffset>0x1058</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>NUMBOFRINGS</name>
                        <description>Generic g_NumRings value.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>AIS31</name>
                        <description>Generic g_AIS31 value.</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AIS31Full</name>
                        <description>Generic g_AIS31Full value.</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PK_POINTERS</name>
                  <description>Pointers register.</description>
                  <addressOffset>0x2000</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>OPPTRA</name>
                        <description>When executing primitive arithmetic operations, this pointer defines where operand A is located in memory (location 0x0 to 0xF).</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>OPPTRB</name>
                        <description>When executing primitive arithmetic operations, this pointer defines where operand B is located in memory (location 0x0 to 0xF).</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>OPPTRC</name>
                        <description>When executing primitive arithmetic operations, this pointer defines the location (0x0 to 0xF) where the result will be stored in memory.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>OPPTRN</name>
                        <description>When executing primitive arithmetic operations, this pointer defines the location where the modulus is located in memory (location 0x0 to 0xF).</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PK_COMMAND</name>
                  <description>Command register.</description>
                  <addressOffset>0x2004</addressOffset>
                  <size>32</size>
                  <resetValue>0x0000000F</resetValue>
                  <fields>
                     <field>
                        <name>OPEADDR</name>
                        <description>This field defines the operation to be performed. See documentation for more details.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>FIELDF</name>
                        <description>'0': Field is GF(p) '1': Field is GF(2**m)</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OPBYTESM1</name>
                        <description>This field defines the size (= number of bytes minus one) of the operands for the current operation. Possible values are limited by the maximum supported operand size. Examples: - 0x014 -&gt; ECC on curve K-163 - 0x01F -&gt; ECC on curve P-256 - 0x02F -&gt; ECC on curve P-384 - 0x033 -&gt; ECC on curve K-409 - 0x041 -&gt; ECC on curve P-521 - 0x07F -&gt; 1024-bit RSA - 0x09F -&gt; 1280-bit RSA - 0x1FF -&gt; 4096-bit RSA - 0x3FF -&gt; 8192-bit RSA</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>10</bitWidth>
                     </field>
                     <field>
                        <name>RANDMOD</name>
                        <description>Enable randomization of modulus (counter-measure).</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SELCURVE</name>
                        <description>Enable accelerator for specific curve modulus: 0x0: No acceleration (default) 0x1: P256 0x2: P384 0x3: P521 0x4: P192 0x5: Curve25519 0x6: Ed25519 This field has no effect when the optional acceleration hardware is not included.</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>RANDKE</name>
                        <description>Enable randomization of exponent/scalar (counter-measure).</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RANDPROJ</name>
                        <description>Enable randomization of projective coordinates (counter-measure).</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EDWARDS</name>
                        <description>Enable Edwards curve (see operation description).</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SWAPBYTES</name>
                        <description>Swap the bytes on AHB interface: '0': Native format (little endian) '1': Byte swapped (big endian) See also section 4.2.1. This bit must be programmed before writing/reading any data in data memory.</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FLAGA</name>
                        <description>See operation description.</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FLAGB</name>
                        <description>See operation description.</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CALCR2</name>
                        <description>This bit indicates if the IP has to calculate R**2 mod N for the next operation. This bit must be set to '1' when a new prime number has been programmed. This bit is used for primitive operations and ignored for the other operations. '0': don't recalculate R**2 mod N '1': re-calculate R**2 mod N</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PK_CONTROL</name>
                  <description>Command register.</description>
                  <addressOffset>0x2008</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>START</name>
                        <description>Writing a '1' starts the processing.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLEARIRQ</name>
                        <description>Writing a '1' clears the IRQ output.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PK_STATUS</name>
                  <description>Status register.</description>
                  <addressOffset>0x200C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>ERRORFLAGS</name>
                        <description>These bits indicate an error condition. They are updated at the end of the operation. They are cleared when starting a new operation. See documentation for more details.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>12</bitWidth>
                     </field>
                     <field>
                        <name>PK_BUSY</name>
                        <description>This bit reflects the BUSY output value. It is set when the operation starts and it is cleared when the operation is finished.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INTRPTSTATUS</name>
                        <description>This bit reflects the IRQ output value. It is set when the operation is finished. It is cleared when the CPU writes the bit 1 of Control Register.</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FAILPTR</name>
                        <description>These bits indicate which data location generated the error flag. They are not available for all error flags.</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PK_TIMER</name>
                  <description>Timer register.</description>
                  <addressOffset>0x2014</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>TIMER</name>
                        <description>Number of core clock cycles.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PK_HWCONFIG</name>
                  <description>Hardware configuration register.</description>
                  <addressOffset>0x2018</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>MAXOPSIZE</name>
                        <description>Maximum operand size (number of bytes).</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>12</bitWidth>
                     </field>
                     <field>
                        <name>NBMULT</name>
                        <description>Number of multipliers: 0x0: 1 multiplier 0x1: 4 multipliers 0x2: 16 multipliers 0x4: 64 multipliers 0x8: 256 multipliers</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>PRIMEFIELD</name>
                        <description>Support prime field.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BINARYFIELD</name>
                        <description>Support binary field.</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P256</name>
                        <description>Support ECC P256 acceleration.</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P384</name>
                        <description>Support ECC P384 acceleration.</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P521</name>
                        <description>Support ECC P521 acceleration.</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>P192</name>
                        <description>Support ECC P192 acceleration.</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>X25519</name>
                        <description>Support Curve25519/Ed25519 acceleration.</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AHBMASTER</name>
                        <description>'0': Memory access through AHB Slave and internally in the PKE.                                                                             '1': Memory access through AHB Master, outside the PKE.</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DISABLESMX</name>
                        <description>State of DisableSMx input (high when SM2/SM9 operations are disabled).</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DISABLECLRMEM</name>
                        <description>State of DisableClrMem input (high when automatic clear of the RAM after reset is disabled).</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DISABLECM</name>
                        <description>State of DisableCM input (high when counter-measures are disabled).</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PK_OPSIZE</name>
                  <description>Operand size register.</description>
                  <addressOffset>0x201C</addressOffset>
                  <size>32</size>
                  <resetValue>0x00001000</resetValue>
                  <fields>
                     <field>
                        <name>OPSIZE</name>
                        <description>Operand size (number of bytes): 0x0100: 256 0x0209: 521 0x0800: 2048 0x0C00: 3072 0x1000: 4096 This register is used when the memory is accessed via AHB Master</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PK_MEMOFFSET</name>
                  <description>Memory offset register.</description>
                  <addressOffset>0x2020</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>MEMOFFSET</name>
                        <description>Memory offset for AHB Master</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PK_MICROCODEOFFSET</name>
                  <description>MicroCode offset register.</description>
                  <addressOffset>0x2024</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>MICROCODEOFFSET</name>
                        <description>MicroCode offset for AHB Master</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
